backend/app/controllers/api/v1/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test投稿"], ["user_id", 1], ["created_at", "2021-10-25 09:25:09.041659"], ["updated_at", "2021-10-25 09:25:09.041659"]]
---
      def create
        @micropost = current_user.microposts.build(micropost_params)
        @micropost.image.attach(params[:micropost][:image])