backend/app/controllers/api/v1/users_controller.rb

      def index
        users = User.where(activated: true)
        users_civilized = users.map do |user|
---
SELECT "users".* FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]
SELECT "users".* FROM "users"

      def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "activation_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

      def destroy
        @user = User.find(params[:id])
        if current_user?(@user) || current_user.admin?
          @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

      def microposts
        @user = User.find(params[:id])
        # 投稿の追加
        @microposts = []
        @user.microposts.each do |post|
          likeStatus = current_user.liked?(post)
          commentCount = post.comment_ids.count
          @microposts << { micropost: post,
                           likeStatus: likeStatus,
                           commentCount: commentCount }
        end
        # いいねした投稿の追加
        @liked_microposts = []
        @user.liked_microposts.each do |post|
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC  [["user_id", 5]]